caonam-tugraz/MultiIMU-GaitSync/firmware/master_esp32s/ESP32-S_ESP_NOW_TIME_SYNC_MASTER.ino
#include <WiFi.h>
#include <esp_now.h>
#include "esp_wifi.h"
#include "esp_idf_version.h"
#include "esp_timer.h"
#include <math.h>
#include <string.h>
#include <cstddef>
#include "esp_bt.h"
#include "esp_now_time_sync_types.h"

/** Master ESP32-S (không TFT): chỉ WiFi STA + ESP-NOW + Serial logger. */

#define CHANNEL 1
#define MAX_SLAVES 10
/** Phải > HELLO_RECONNECT_INTERVAL slave (3 s) và thời gian chờ SYNC/TBURST. */
#define SLAVE_RX_TIMEOUT_MS 5000UL
#define SLAVE_RSSI_MA_N 10
/** Chu kỳ in RSSI trung bình slave ra Serial (thay cập nhật TFT). */
#define SLAVE_RSSI_LOG_INTERVAL_MS 3000UL
#define USE_LONG_RANGE 1
/** esp_wifi_set_max_tx_power: đơn vị 0,25 dBm; ESP32 thường 8…84 (≈2…21 dBm). Tối thiểu = 8. */
#define MAX_TX_POWER 8
/** Tăng công suất phát khi RSSI slave (MA) thấp; giảm khi link ổn (hysteresis). */
#ifndef MASTER_WIFI_TX_POWER_ADAPTIVE
#define MASTER_WIFI_TX_POWER_ADAPTIVE 1
#endif
#ifndef MASTER_WIFI_TX_POWER_NORM_QDB
#define MASTER_WIFI_TX_POWER_NORM_QDB MAX_TX_POWER
#endif
#ifndef MASTER_WIFI_TX_POWER_BOOST_QDB
#define MASTER_WIFI_TX_POWER_BOOST_QDB 84
#endif
#ifndef MASTER_WIFI_TX_RSSI_BOOST_DB
#define MASTER_WIFI_TX_RSSI_BOOST_DB (-75)
#endif
#ifndef MASTER_WIFI_TX_RSSI_RESTORE_DB
#define MASTER_WIFI_TX_RSSI_RESTORE_DB (-65)
#endif
#ifndef MASTER_WIFI_TX_POWER_ADJ_INTERVAL_MS
#define MASTER_WIFI_TX_POWER_ADJ_INTERVAL_MS 2000U
#endif

/** Số mẫu tối đa mỗi gói IMU_LOST (chia nhỏ nếu thiếu dài). */
#ifndef MASTER_IMU_LOST_MAX_CHUNK
#define MASTER_IMU_LOST_MAX_CHUNK 32U
#endif
/**
 * 1 = phát hiện lỗ hổng seq IMU → gửi IMU_LOST cho slave truyền lại (+ timeout poll).
 * 0 = tắt tạm, không request retx (lọc Serial: MASTER_SERIAL_SEQ_FILTER).
 */
#ifndef MASTER_IMU_LOST_REQUEST_ENABLE
#define MASTER_IMU_LOST_REQUEST_ENABLE 0
#endif

/**
 * 1 = lọc trùng / reorder sample_seq (theo MAC) trước khi gửi UART tới PC.
 * 0 = gửi hết mọi mẫu nhận được (IMU + VL53), không bỏ mẫu theo seq.
 */
#ifndef MASTER_SERIAL_SEQ_FILTER
#define MASTER_SERIAL_SEQ_FILTER 0
#endif

/** Pin 1 cell Li-ion: đầy / cạn (V tại cell). % = nội suy theo Vcell (Vadc sau cầu × 2). */
#define VBAT_CELL_FULL_V 4.1f
#define VBAT_CELL_EMPTY_V 3.2f
/** Cầu chia: Vadc tại chân = Vcell × scale (0.5 → Vcell = Vadc / scale). */
#define VBAT_ADC_PIN_VCELL_SCALE 0.496f
#define VBAT_ADC_PIN_AT_CELL_FULL_V (VBAT_CELL_FULL_V * VBAT_ADC_PIN_VCELL_SCALE)
#define VBAT_ADC_REF_V 3.3f
#define VBAT_VCELL_PER_VADC (VBAT_CELL_FULL_V / VBAT_ADC_PIN_AT_CELL_FULL_V)

/**
 * Slave HELLO_KEEPALIVE=0 → chỉ HELLO khi chưa connected (reconnect).
 * Master luôn ACK mọi HELLO (đủ cho kết nối lại; không còn spam 2s khi đã stream IMU).
 */

// 1: Serial gửi khung nhị phân (sync 4 byte + payload raw + CRC16 LE) cho PC/logger; 0: dòng chữ IMU,...
#define IMU_SERIAL_BINARY 1

// Khớp scale trên Slave (imu_logger / imu_serial_codec.py)
#define IMU_RAW_ACC_SCALE 512.0f
#define IMU_GYRO_FS_DPS 2000.0f
#define IMU_RAW_GYRO_SCALE (32767.0f / IMU_GYRO_FS_DPS)
#define IMU_TEMP_CENTI_SCALE 100.0f

static MacSeqTrack g_macSeqTrack[MASTER_MAC_SEQ_TRACK];
static uint8_t g_macSeqTrackCount = 0;

static MacSeqTrack *masterMacSeqFindOrAdd(const uint8_t *mac) {
  for (uint8_t i = 0; i < g_macSeqTrackCount; i++) {
    if (memcmp(g_macSeqTrack[i].mac, mac, 6) == 0) {
      return &g_macSeqTrack[i];
    }
  }
  if (g_macSeqTrackCount < MASTER_MAC_SEQ_TRACK) {
    MacSeqTrack *p = &g_macSeqTrack[g_macSeqTrackCount++];
    memcpy(p->mac, mac, 6);
    p->imu_inited = false;
    p->imu_last = 0U;
    p->vl53_inited = false;
    p->vl53_last = 0U;
    return p;
  }
  return NULL;
}

static bool masterSeqStreamShouldForward(bool *inited, uint32_t *last, uint32_t seq) {
  if (!*inited) {
    *inited = true;
    *last = seq;
    return true;
  }
  uint32_t delta = (seq - *last) & 0xFFFFFFFFU;
  if (delta == 0) {
    return false;
  }
  if (delta == 1) {
    *last = seq;
    return true;
  }
  if (delta > 0x7FFFFFFFU) {
    uint32_t backward = (*last - seq) & 0xFFFFFFFFU;
    if (backward <= MASTER_SEQ_REORDER_BACK_MAX) {
      return false;
    }
    *last = seq;
    return true;
  }
  if (delta > MASTER_SEQ_RESET_THRESHOLD) {
    *last = seq;
    return true;
  }
  *last = seq;
  return true;
}

static void masterSendImuLostForGap(MacSeqTrack *t, uint32_t seq_first, uint32_t nmiss, uint32_t node_id);
static void masterImuRetxMarkSample(const uint8_t *mac, uint32_t seq);
static void masterImuRetxTimeoutPoll(void);

static bool imuStreamAllowForwardAndRequestLost(MacSeqTrack *t, uint32_t node_id, uint32_t seq) {
  if (!t) {
    return true;
  }
  if (t->imu_inited) {
    uint32_t last = t->imu_last;
    uint32_t delta = (seq - last) & 0xFFFFFFFFU;
#if MASTER_IMU_LOST_REQUEST_ENABLE
    if (delta > 1U && delta < 0x7FFFFFFFU && delta <= MASTER_SEQ_RESET_THRESHOLD) {
      masterSendImuLostForGap(t, last + 1U, delta - 1U, node_id);
    }
#endif
  }
  return masterSeqStreamShouldForward(&t->imu_inited, &t->imu_last, seq);
}

static bool imuSerialShouldForwardWithNode(const uint8_t *mac, uint32_t node_id, uint32_t seq) {
  MacSeqTrack *t = masterMacSeqFindOrAdd(mac);
  return imuStreamAllowForwardAndRequestLost(t, node_id, seq);
}

static bool vl53SerialShouldForward(const uint8_t *mac, uint32_t seq) {
  MacSeqTrack *t = masterMacSeqFindOrAdd(mac);
  if (!t) {
    return true;
  }
  return masterSeqStreamShouldForward(&t->vl53_inited, &t->vl53_last, seq);
}

static inline int16_t masterFloatToI16(float v, float scale) {
  float x = roundf(v * scale);
  if (x > 32767.0f) return 32767;
  if (x < -32768.0f) return -32768;
  return (int16_t)x;
}

static void serialWriteImuRawFrameImpl(imu_packet_raw_t raw) {
  raw.master_micros_at_tx = nowUs();
  static const uint8_t kImuSync[] = {0xA5, 0x5A, 0xA5, 0x5A};
  Serial.write(kImuSync, sizeof(kImuSync));
  Serial.write((const uint8_t *)&raw, sizeof(raw));
  uint16_t crc = imu_serial_crc16_ccitt_false((const uint8_t *)&raw, sizeof(raw));
  Serial.write((uint8_t)(crc & 0xFF));
  Serial.write((uint8_t)((crc >> 8) & 0xFF));
}

/** Gửi IMU ra PC; tuỳ MASTER_SERIAL_SEQ_FILTER có lọc trùng seq hay gửi hết. */
static void serialWriteImuRawFrame(const imu_packet_raw_t &raw) {
#if MASTER_SERIAL_SEQ_FILTER
  if (!imuSerialShouldForwardWithNode(raw.mac, raw.node_id, raw.sample_seq)) {
    return;
  }
#endif
  serialWriteImuRawFrameImpl(raw);
}

