caonam-tugraz/MultiIMU-GaitSync/firmware/master_esp32s/ESP32-S_ESP_NOW_TIME_SYNC_MASTER.ino
// UART raw VL53: sync khác IMU để PC tách khung; payload = vl53_packet_t (packed, khớp esp_now_time_sync_types.h)
static void serialWriteVl53RawFrame(const vl53_packet_t &v) {
#if MASTER_SERIAL_SEQ_FILTER
  if (!vl53SerialShouldForward(v.mac, v.sample_seq)) {
    return;
  }
#endif
  static const uint8_t kVl53Sync[] = {0xB5, 0x5B, 0xB5, 0x5B};
  Serial.write(kVl53Sync, sizeof(kVl53Sync));
  Serial.write((const uint8_t *)&v, sizeof(v));
  uint16_t crc = imu_serial_crc16_ccitt_false((const uint8_t *)&v, sizeof(v));
  Serial.write((uint8_t)(crc & 0xFF));
  Serial.write((uint8_t)((crc >> 8) & 0xFF));
}

static imu_packet_raw_t floatImuPacketToRaw(const imu_packet_t &imu) {
  imu_packet_raw_t raw = {};
  memcpy(raw.type, "IMU_RAW\0", 8);
  memcpy(raw.mac, imu.mac, 6);
  raw.node_id = imu.node_id;
  raw.micros_timestamp = imu.micros_timestamp;
  raw.sample_seq = 0;
  raw.ax = masterFloatToI16(imu.ax, IMU_RAW_ACC_SCALE);
  raw.ay = masterFloatToI16(imu.ay, IMU_RAW_ACC_SCALE);
  raw.az = masterFloatToI16(imu.az, IMU_RAW_ACC_SCALE);
  raw.gx = masterFloatToI16(imu.gx, IMU_RAW_GYRO_SCALE);
  raw.gy = masterFloatToI16(imu.gy, IMU_RAW_GYRO_SCALE);
  raw.gz = masterFloatToI16(imu.gz, IMU_RAW_GYRO_SCALE);
  raw.mx = 0;
  raw.my = 0;
  raw.mz = 0;
  raw.temp_centi_c = 0;
  return raw;
}

static uint64_t masterImuBatchEndMicros(const imu_batch_packet_t &pkt) {
  uint64_t t = pkt.micros_t0;
  for (uint32_t i = 1; i < pkt.count; i++) {
    t += pkt.rest[i - 1].delta_us_from_prev;
  }
  return t;
}

static uint64_t masterVl53BatchEndMicros(const vl53_batch_packet_t &pkt) {
  uint64_t t = pkt.micros_t0;
  for (uint32_t i = 1; i < pkt.count; i++) {
    t += pkt.rest[i - 1].delta_us_from_prev;
  }
  return t;
}

// Slave gửi IMU_RAWB: nhiều mẫu trong một gói ESP-NOW → tách ra nhiều khung Serial (IMU_RAW + imu_packet_raw_t).
static bool tryExpandImuBatchToSerial(const uint8_t *data, int len, uint64_t rxUs) {
  if (len < (int)IMU_BATCH_HEADER_SIZE) {
    return false;
  }
  imu_batch_packet_t pkt = {};
  size_t copy_len = (size_t)len;
  if (copy_len > sizeof(pkt)) {
    copy_len = sizeof(pkt);
  }
  memcpy(&pkt, data, copy_len);
  if (memcmp(pkt.type, "IMU_RAWB", 8) != 0) {
    return false;
  }
  if (pkt.count < 1 || pkt.count > IMU_BATCH_MAX_SAMPLES) {
    return false;
  }
  int expected =
      (int)(IMU_BATCH_HEADER_SIZE +
            (size_t)(pkt.count - 1U) * sizeof(imu_batch_delta_t));
  if (len != expected) {
    return false;
  }

  imu_packet_raw_t raw = {};
  memcpy(raw.type, "IMU_RAW\0", 8);
  memcpy(raw.mac, pkt.mac, 6);
  raw.node_id = pkt.node_id;
  raw.micros_timestamp = pkt.micros_t0;
  raw.sample_seq = pkt.sample_seq0;
  raw.ax = pkt.ax0;
  raw.ay = pkt.ay0;
  raw.az = pkt.az0;
  raw.gx = pkt.gx0;
  raw.gy = pkt.gy0;
  raw.gz = pkt.gz0;
  raw.mx = pkt.mx0;
  raw.my = pkt.my0;
  raw.mz = pkt.mz0;
  raw.temp_centi_c = pkt.temp_centi_c;
  masterImuRetxMarkSample(raw.mac, raw.sample_seq);
  serialWriteImuRawFrame(raw);

  uint64_t t = pkt.micros_t0;
  for (uint32_t i = 1; i < pkt.count; i++) {
    t += pkt.rest[i - 1].delta_us_from_prev;
    raw.micros_timestamp = t;
    raw.sample_seq = pkt.sample_seq0 + i;
    raw.ax = pkt.rest[i - 1].ax;
    raw.ay = pkt.rest[i - 1].ay;
    raw.az = pkt.rest[i - 1].az;
    raw.gx = pkt.rest[i - 1].gx;
    raw.gy = pkt.rest[i - 1].gy;
    raw.gz = pkt.rest[i - 1].gz;
    raw.mx = pkt.rest[i - 1].mx;
    raw.my = pkt.rest[i - 1].my;
    raw.mz = pkt.rest[i - 1].mz;
    raw.temp_centi_c = pkt.temp_centi_c;
    masterImuRetxMarkSample(raw.mac, raw.sample_seq);
    serialWriteImuRawFrame(raw);
  }
  return true;
}

// Slave gửi IMU_RETXB: cùng layout IMU_RAWB — ghi Serial không lọc seq (gửi lại mẫu thiếu).
static bool tryExpandImuRtxBatchToSerial(const uint8_t *data, int len, uint64_t rxUs) {
  if (len < (int)IMU_BATCH_HEADER_SIZE) {
    return false;
  }
  imu_batch_packet_t pkt = {};
  size_t copy_len = (size_t)len;
  if (copy_len > sizeof(pkt)) {
    copy_len = sizeof(pkt);
  }
  memcpy(&pkt, data, copy_len);
  if (memcmp(pkt.type, "IMU_RTXB", 8) != 0) {
    return false;
  }
  if (pkt.count < 1 || pkt.count > IMU_BATCH_MAX_SAMPLES) {
    return false;
  }
  int expected =
      (int)(IMU_BATCH_HEADER_SIZE +
            (size_t)(pkt.count - 1U) * sizeof(imu_batch_delta_t));
  if (len != expected) {
    return false;
  }

  imu_packet_raw_t raw = {};
  memcpy(raw.type, "IMU_RAW\0", 8);
  memcpy(raw.mac, pkt.mac, 6);
  raw.node_id = pkt.node_id;
  raw.micros_timestamp = pkt.micros_t0;
  raw.sample_seq = pkt.sample_seq0;
  raw.ax = pkt.ax0;
  raw.ay = pkt.ay0;
  raw.az = pkt.az0;
  raw.gx = pkt.gx0;
  raw.gy = pkt.gy0;
  raw.gz = pkt.gz0;
  raw.mx = pkt.mx0;
  raw.my = pkt.my0;
  raw.mz = pkt.mz0;
  raw.temp_centi_c = pkt.temp_centi_c;
  masterImuRetxMarkSample(raw.mac, raw.sample_seq);
  serialWriteImuRawFrameImpl(raw);

  uint64_t t = pkt.micros_t0;
  for (uint32_t i = 1; i < pkt.count; i++) {
    t += pkt.rest[i - 1].delta_us_from_prev;
    raw.micros_timestamp = t;
    raw.sample_seq = pkt.sample_seq0 + i;
    raw.ax = pkt.rest[i - 1].ax;
    raw.ay = pkt.rest[i - 1].ay;
    raw.az = pkt.rest[i - 1].az;
    raw.gx = pkt.rest[i - 1].gx;
    raw.gy = pkt.rest[i - 1].gy;
    raw.gz = pkt.rest[i - 1].gz;
    raw.mx = pkt.rest[i - 1].mx;
    raw.my = pkt.rest[i - 1].my;
    raw.mz = pkt.rest[i - 1].mz;
    raw.temp_centi_c = pkt.temp_centi_c;
    masterImuRetxMarkSample(raw.mac, raw.sample_seq);
    serialWriteImuRawFrameImpl(raw);
  }
  Serial.printf(
      "IMU_LOG,LOST_RTX,%02X:%02X:%02X:%02X:%02X:%02X,%lu,%u,%lu\n",
      pkt.mac[0], pkt.mac[1], pkt.mac[2], pkt.mac[3], pkt.mac[4], pkt.mac[5],
      (unsigned long)pkt.node_id, (unsigned)pkt.count, (unsigned long)pkt.sample_seq0);
  return true;
}

// Slave gửi VL53RAWB: nhiều mẫu trong một gói → Serial từng mẫu (text hoặc khung B5+66 byte).
static bool tryExpandVl53BatchToSerial(const uint8_t *data, int len, uint64_t rxUs) {
  if (len < (int)VL53_BATCH_HEADER_SIZE) {
    return false;
  }
  vl53_batch_packet_t pkt = {};
  size_t copy_len = (size_t)len;
  if (copy_len > sizeof(pkt)) {
    copy_len = sizeof(pkt);
  }
  memcpy(&pkt, data, copy_len);
  if (memcmp(pkt.type, "VL53RAWB", 8) != 0) {
    return false;
  }
  if (pkt.count < 1 || pkt.count > VL53_BATCH_MAX_SAMPLES) {
    return false;
  }
  int expected =
      (int)(VL53_BATCH_HEADER_SIZE +
            (size_t)(pkt.count - 1U) * sizeof(vl53_batch_delta_t));
  if (len != expected) {
    return false;
  }

  uint64_t t = pkt.micros_t0;
  for (uint32_t i = 0; i < pkt.count; i++) {
    if (i > 0) {
      t += pkt.rest[i - 1].delta_us_from_prev;
    }
    uint32_t seq = pkt.sample_seq0 + i;
    const int16_t *zones =
        (i == 0) ? pkt.d0 : pkt.rest[i - 1].distance_raw;
#if IMU_SERIAL_BINARY
    vl53_packet_t v = {};
    memcpy(v.type, "VL53\0\0\0\0", 8);
    memcpy(v.mac, pkt.mac, 6);
    v.node_id = pkt.node_id;
    v.timestamp = (uint32_t)(t / 1000ULL);
    v.micros_timestamp = t;
    v.sample_seq = seq;
    memcpy(v.distance_raw, zones, sizeof(v.distance_raw));
    serialWriteVl53RawFrame(v);
#else
#if MASTER_SERIAL_SEQ_FILTER
    if (!vl53SerialShouldForward(pkt.mac, seq)) {
      continue;
    }
#endif
    Serial.printf("VL53,%02X:%02X:%02X:%02X:%02X:%02X,%lu,%llu,%lu",
                  pkt.mac[0], pkt.mac[1], pkt.mac[2], pkt.mac[3], pkt.mac[4],
                  pkt.mac[5], (unsigned long)(t / 1000ULL),
                  (unsigned long long)t, (unsigned long)seq);
    for (int z = 0; z < VL53_ZONE_COUNT; z++) {
      Serial.printf(",%d", (int)zones[z]);
    }
    Serial.println();
#endif
  }
  return true;
}

