caonam-tugraz/MultiIMU-GaitSync/firmware/master_esp32s/ESP32-S_ESP_NOW_TIME_SYNC_MASTER.ino
uint8_t slaveList[MAX_SLAVES][6];
/** Slot TDMA do Master cấp (thu hồi khi timeout / removeSlaveAt). */
static uint8_t slaveImuTxSlot[MAX_SLAVES];
static uint8_t slaveSyncSlot[MAX_SLAVES];
static bool slaveSlotAssigned[MAX_SLAVES];
static bool imuTxSlotPoolUsed[MASTER_IMU_TX_SLOT_COUNT];
static bool syncSlotPoolUsed[MASTER_SYNC_SLOT_COUNT];
uint32_t slaveLastSeenMs[MAX_SLAVES];
uint64_t slaveLastSyncUs[MAX_SLAVES];
uint32_t slaveLastSyncRttUs[MAX_SLAVES];
int8_t slaveLastRssi[MAX_SLAVES];
bool slaveRssiValid[MAX_SLAVES];
int8_t slaveRssiWin[MAX_SLAVES][SLAVE_RSSI_MA_N];
uint8_t slaveRssiWinN[MAX_SLAVES];
uint8_t slaveRssiWinPos[MAX_SLAVES];
uint8_t slaveLastBatPct[MAX_SLAVES];
bool slaveBatValid[MAX_SLAVES];
/** Ước lượng điện áp cell (V); đồng bộ logic SYNC/GUI serial. */
float slaveLastVcell[MAX_SLAVES];
int slaveCount = 0;

/** Điện áp tại chân ADC sau cầu (chia 2), từ raw 12-bit. */
static float adcRawToVadcPin(uint16_t raw12) {
  return (float)raw12 * (VBAT_ADC_REF_V / 4095.0f);
}

/** Điện áp cell = Vadc × (1/scale) = Vadc × VBAT_VCELL_PER_VADC. */
static float adcRawToVcellEst(uint16_t raw12) {
  return adcRawToVadcPin(raw12) * VBAT_VCELL_PER_VADC;
}

/** % pin theo điện áp cell 3.5V…4.1V (100% tại 4.1V). */
static uint8_t adcRawToBatteryPct(uint16_t raw12) {
  const float Vcell = adcRawToVcellEst(raw12);
  if (Vcell >= VBAT_CELL_FULL_V) {
    return 100;
  }
  if (Vcell <= VBAT_CELL_EMPTY_V) {
    return 0;
  }
  float pct =
      (Vcell - VBAT_CELL_EMPTY_V) / (VBAT_CELL_FULL_V - VBAT_CELL_EMPTY_V) * 100.0f;
  if (pct > 100.0f) {
    pct = 100.0f;
  }
  if (pct < 0.0f) {
    pct = 0.0f;
  }
  return (uint8_t)(pct + 0.5f);
}

static int slaveIndexForMac(const uint8_t *mac) {
  for (int i = 0; i < slaveCount; i++) {
    if (memcmp(mac, slaveList[i], 6) == 0) {
      return i;
    }
  }
  return -1;
}

static int masterAllocImuTxSlot() {
  for (uint8_t i = 0; i < MASTER_IMU_TX_SLOT_COUNT; i++) {
    if (!imuTxSlotPoolUsed[i]) {
      imuTxSlotPoolUsed[i] = true;
      return (int)i;
    }
  }
  return -1;
}

static int masterAllocSyncSlot() {
  for (uint8_t i = 0; i < MASTER_SYNC_SLOT_COUNT; i++) {
    if (!syncSlotPoolUsed[i]) {
      syncSlotPoolUsed[i] = true;
      return (int)i;
    }
  }
  return -1;
}

static void masterFreeImuTxSlot(uint8_t slot) {
  if (slot < MASTER_IMU_TX_SLOT_COUNT) {
    imuTxSlotPoolUsed[slot] = false;
  }
}

static void masterFreeSyncSlot(uint8_t slot) {
  if (slot < MASTER_SYNC_SLOT_COUNT) {
    syncSlotPoolUsed[slot] = false;
  }
}

static void masterReleaseSlaveSlots(int si) {
  if (si < 0 || si >= slaveCount || !slaveSlotAssigned[si]) {
    return;
  }
  masterFreeImuTxSlot(slaveImuTxSlot[si]);
  masterFreeSyncSlot(slaveSyncSlot[si]);
  slaveImuTxSlot[si] = MASTER_SLOT_UNASSIGNED;
  slaveSyncSlot[si] = MASTER_SLOT_UNASSIGNED;
  slaveSlotAssigned[si] = false;
}

static bool masterAssignSlaveSlots(int si) {
  if (si < 0 || si >= MAX_SLAVES) {
    return false;
  }
  int imu = masterAllocImuTxSlot();
  int sync = masterAllocSyncSlot();
  if (imu < 0 || sync < 0) {
    if (imu >= 0) {
      masterFreeImuTxSlot((uint8_t)imu);
    }
    if (sync >= 0) {
      masterFreeSyncSlot((uint8_t)sync);
    }
    Serial.println("❌ Het slot TDMA (IMU hoac SYNC)");
    return false;
  }
  slaveImuTxSlot[si] = (uint8_t)imu;
  slaveSyncSlot[si] = (uint8_t)sync;
  slaveSlotAssigned[si] = true;
  Serial.printf("   Slot cap phat: IMU=%u/%u, SYNC=%u/%u\n",
                (unsigned)slaveImuTxSlot[si], (unsigned)MASTER_IMU_TX_SLOT_COUNT,
                (unsigned)slaveSyncSlot[si], (unsigned)MASTER_SYNC_SLOT_COUNT);
  return true;
}

static void masterFillPacketSlots(packet_t *p, int si) {
  if (!p) {
    return;
  }
  p->imu_tx_slot = MASTER_SLOT_UNASSIGNED;
  p->sync_slot = MASTER_SLOT_UNASSIGNED;
  p->imu_tx_slot_count = MASTER_IMU_TX_SLOT_COUNT;
  p->slot_flags = 0;
  if (si < 0 || si >= slaveCount || !slaveSlotAssigned[si]) {
    return;
  }
  p->imu_tx_slot = slaveImuTxSlot[si];
  p->sync_slot = slaveSyncSlot[si];
  p->slot_flags = PACKET_T_SLOT_FLAG_VALID;
}

static void slaveRssiPushSample(int si, int8_t r) {
  if (si < 0 || si >= slaveCount) {
    return;
  }
  if (slaveRssiWinN[si] < SLAVE_RSSI_MA_N) {
    slaveRssiWin[si][slaveRssiWinN[si]++] = r;
  } else {
    slaveRssiWin[si][slaveRssiWinPos[si]] = r;
    slaveRssiWinPos[si] =
        (uint8_t)((slaveRssiWinPos[si] + 1U) % (uint8_t)SLAVE_RSSI_MA_N);
  }
}

/** Cập nhật slaveLastRssi / slaveRssiValid từ cửa sổ MA (log Serial định kỳ). */
static void updateSlaveRssiDisplayFromWindows(void) {
  for (int i = 0; i < slaveCount; i++) {
    const uint8_t n = slaveRssiWinN[i];
    if (n == 0U) {
      slaveRssiValid[i] = false;
      continue;
    }
    int32_t sum = 0;
    if (n < (uint8_t)SLAVE_RSSI_MA_N) {
      for (uint8_t k = 0; k < n; k++) {
        sum += (int32_t)slaveRssiWin[i][k];
      }
      slaveLastRssi[i] = (int8_t)((sum + (int32_t)n / 2) / (int32_t)n);
    } else {
      for (uint8_t k = 0; k < (uint8_t)SLAVE_RSSI_MA_N; k++) {
        sum += (int32_t)slaveRssiWin[i][k];
      }
      slaveLastRssi[i] = (int8_t)((sum + 5) / 10);
    }
    slaveRssiValid[i] = true;
  }
}

#if MASTER_WIFI_TX_POWER_ADAPTIVE
static int8_t s_masterWifiTxQdb = 0;
static bool s_masterWifiTxBoosted = false;
static uint32_t s_masterWifiTxLastAdjMs = 0;

static int8_t masterWifiClampTxQdb(int8_t qdb) {
  if (qdb < 8) {
    return 8;
  }
  if (qdb > 84) {
    return 84;
  }
  return qdb;
}

static bool masterWifiApplyTxPowerQdb(int8_t qdb) {
  qdb = masterWifiClampTxQdb(qdb);
  if (qdb == s_masterWifiTxQdb) {
    return false;
  }
  const esp_err_t e = esp_wifi_set_max_tx_power(qdb);
  if (e != ESP_OK) {
    return false;
  }
  s_masterWifiTxQdb = qdb;
  return true;
}

static void masterWifiTxPowerInit(void) {
  s_masterWifiTxBoosted = false;
  if (masterWifiApplyTxPowerQdb((int8_t)MASTER_WIFI_TX_POWER_NORM_QDB)) {
    Serial.printf("[LINK] Master TX init: quarter-dBm=%d (~%.1f dBm)\n",
                  (int)s_masterWifiTxQdb, (double)s_masterWifiTxQdb * 0.25);
  }
}

static void masterWifiTxPowerUpdateFromRssi(int8_t rssiDb) {
  const uint32_t now = millis();
  if (s_masterWifiTxLastAdjMs != 0U &&
      (uint32_t)(now - s_masterWifiTxLastAdjMs) < MASTER_WIFI_TX_POWER_ADJ_INTERVAL_MS) {
    return;
  }

  bool wantBoost;
  if (rssiDb < (int8_t)MASTER_WIFI_TX_RSSI_BOOST_DB) {
    wantBoost = true;
  } else if (rssiDb >= (int8_t)MASTER_WIFI_TX_RSSI_RESTORE_DB) {
    wantBoost = false;
  } else {
    return;
  }

  if (wantBoost == s_masterWifiTxBoosted) {
    return;
  }

  const int8_t target = wantBoost ? (int8_t)MASTER_WIFI_TX_POWER_BOOST_QDB
                                  : (int8_t)MASTER_WIFI_TX_POWER_NORM_QDB;
  if (!masterWifiApplyTxPowerQdb(target)) {
    return;
  }
  s_masterWifiTxBoosted = wantBoost;
  s_masterWifiTxLastAdjMs = now;
  Serial.printf("[LINK] Master TX %s: quarter-dBm=%d (~%.1f dBm), min RSSI=%d dBm\n",
                wantBoost ? "BOOST" : "NORM", (int)target, (double)target * 0.25,
                (int)rssiDb);
}

