caonam-tugraz/MultiIMU-GaitSync/firmware/master_esp32s/ESP32-S_ESP_NOW_TIME_SYNC_MASTER.ino
static void masterWifiTxPowerRecomputeFromSlaves(void) {
  if (slaveCount <= 0) {
    return;
  }
  updateSlaveRssiDisplayFromWindows();
  int8_t minRssi = 127;
  bool any = false;
  for (int i = 0; i < slaveCount; i++) {
    if (!slaveRssiValid[i]) {
      continue;
    }
    any = true;
    if (slaveLastRssi[i] < minRssi) {
      minRssi = slaveLastRssi[i];
    }
  }
  if (any) {
    masterWifiTxPowerUpdateFromRssi(minRssi);
  }
}
#endif

static void noteSlaveRssiIfKnown(const esp_now_recv_info *info, const uint8_t *src) {
  if (!info || !info->rx_ctrl) {
    return;
  }
  int si = slaveIndexForMac(src);
  if (si < 0) {
    return;
  }
  slaveRssiPushSample(si, (int8_t)info->rx_ctrl->rssi);
#if MASTER_WIFI_TX_POWER_ADAPTIVE
  masterWifiTxPowerRecomputeFromSlaves();
#endif
}

unsigned long lastPrint = 0;
int masterTimezone = 7; // GMT+7

char serialLineBuf[192];
size_t serialLineLen = 0;

uint64_t nowUs() {
  return (uint64_t)esp_timer_get_time();
}

uint32_t nowMs() {
  return (uint32_t)(nowUs() / 1000ULL);
}

void printMAC(const uint8_t *mac) {
  for (int i = 0; i < 6; i++) {
    Serial.printf("%02X", mac[i]);
    if (i < 5) Serial.print(":");
  }
}

String macToString(const uint8_t *mac) {
  char buf[18];
  snprintf(buf, sizeof(buf), "%02X:%02X:%02X:%02X:%02X:%02X",
           mac[0], mac[1], mac[2], mac[3], mac[4], mac[5]);
  return String(buf);
}

bool parseMacString(const char *text, uint8_t *mac) {
  unsigned int values[6];
  if (sscanf(text, "%2x:%2x:%2x:%2x:%2x:%2x",
             &values[0], &values[1], &values[2],
             &values[3], &values[4], &values[5]) != 6) {
    return false;
  }
  for (int i = 0; i < 6; i++) {
    mac[i] = (uint8_t)values[i];
  }
  return true;
}

void printSlaveList() {
  Serial.println("\n📋 Danh sách slave hiện tại:");
  if (slaveCount == 0) {
    Serial.println("   (Chưa có thiết bị nào)");
    return;
  }

  for (int i = 0; i < slaveCount; i++) {
    Serial.printf("   #%d: ", i + 1);
    printMAC(slaveList[i]);
    if (slaveSlotAssigned[i]) {
      Serial.printf("  IMU_slot=%u  SYNC_slot=%u",
                    (unsigned)slaveImuTxSlot[i], (unsigned)slaveSyncSlot[i]);
    }
    Serial.println();
  }

  Serial.printf("→ Tổng số slave: %d\n", slaveCount);
  Serial.println("----------------------------------");
}

static void logSlaveRssiSummary(void) {
  if (slaveCount <= 0) {
    return;
  }
  Serial.println("--- RSSI/BAT (MA) ---");
  for (int i = 0; i < slaveCount; i++) {
    Serial.printf("  #%d %02X:%02X:%02X:%02X:%02X:%02X ", i + 1,
                  slaveList[i][0], slaveList[i][1], slaveList[i][2],
                  slaveList[i][3], slaveList[i][4], slaveList[i][5]);
    if (slaveRssiValid[i]) {
      Serial.printf("RSSI=%d dBm ", (int)slaveLastRssi[i]);
    } else {
      Serial.print("RSSI=-- ");
    }
    if (slaveBatValid[i]) {
      Serial.printf("BAT=%u%%\n", (unsigned)slaveLastBatPct[i]);
    } else {
      Serial.println("BAT=--");
    }
  }
}

void printMasterTime() {
  uint32_t currentMs = nowMs();

  int hours = (currentMs / 3600000UL) % 24;
  int minutes = (currentMs / 60000UL) % 60;
  int seconds = (currentMs / 1000UL) % 60;
  int milliseconds = currentMs % 1000UL;

  Serial.printf("🕐 Master Time: %02d:%02d:%02d.%03d\n",
                hours, minutes, seconds, milliseconds);
}

bool isSlaveKnown(const uint8_t *mac) {
  for (int i = 0; i < slaveCount; i++) {
    if (memcmp(mac, slaveList[i], 6) == 0) return true;
  }
  return false;
}

static unsigned long nowMsForSeen() {
  unsigned long t = millis();
  return (t == 0) ? 1UL : t;
}

static void markSlaveSeen(const uint8_t *mac) {
  for (int i = 0; i < slaveCount; i++) {
    if (memcmp(mac, slaveList[i], 6) == 0) {
      slaveLastSeenMs[i] = nowMsForSeen();
      return;
    }
  }
}

static void removeSlaveAt(int idx) {
  if (idx < 0 || idx >= slaveCount) {
    return;
  }
  esp_err_t del = esp_now_del_peer(slaveList[idx]);
  (void)del;
  Serial.print("⏱ Slave timeout (>");
  Serial.print((unsigned long)(SLAVE_RX_TIMEOUT_MS / 1000UL));
  Serial.print("s), removed: ");
  printMAC(slaveList[idx]);
  if (slaveSlotAssigned[idx]) {
    Serial.printf(" (thu hoi IMU slot %u, SYNC slot %u)",
                  (unsigned)slaveImuTxSlot[idx], (unsigned)slaveSyncSlot[idx]);
  }
  Serial.println();
  masterReleaseSlaveSlots(idx);
  for (int j = idx; j < slaveCount - 1; j++) {
    memcpy(slaveList[j], slaveList[j + 1], 6);
    slaveImuTxSlot[j] = slaveImuTxSlot[j + 1];
    slaveSyncSlot[j] = slaveSyncSlot[j + 1];
    slaveSlotAssigned[j] = slaveSlotAssigned[j + 1];
    slaveLastSeenMs[j] = slaveLastSeenMs[j + 1];
    slaveLastSyncUs[j] = slaveLastSyncUs[j + 1];
    slaveLastSyncRttUs[j] = slaveLastSyncRttUs[j + 1];
    slaveLastRssi[j] = slaveLastRssi[j + 1];
    slaveRssiValid[j] = slaveRssiValid[j + 1];
    slaveRssiWinN[j] = slaveRssiWinN[j + 1];
    slaveRssiWinPos[j] = slaveRssiWinPos[j + 1];
    memcpy(slaveRssiWin[j], slaveRssiWin[j + 1], sizeof(slaveRssiWin[0]));
    slaveLastBatPct[j] = slaveLastBatPct[j + 1];
    slaveBatValid[j] = slaveBatValid[j + 1];
    slaveLastVcell[j] = slaveLastVcell[j + 1];
  }
  slaveCount--;
}

static void checkSlaveTimeouts() {
  unsigned long now = millis();
  if (now == 0) {
    now = 1;
  }
  for (int i = slaveCount - 1; i >= 0; i--) {
    if (slaveLastSeenMs[i] == 0) {
      slaveLastSeenMs[i] = nowMsForSeen();
      continue;
    }
    if ((unsigned long)(now - slaveLastSeenMs[i]) >= SLAVE_RX_TIMEOUT_MS) {
      removeSlaveAt(i);
    }
  }
}

bool ensureSlavePeer(const uint8_t *mac) {
  if (isSlaveKnown(mac)) {
    markSlaveSeen(mac);
    return true;
  }
  if (slaveCount >= MAX_SLAVES) return false;

  esp_now_peer_info_t peerInfo = {};
  memcpy(peerInfo.peer_addr, mac, 6);
  peerInfo.channel = CHANNEL;
  peerInfo.ifidx = WIFI_IF_STA;
  peerInfo.encrypt = false;

  esp_err_t addResult = esp_now_add_peer(&peerInfo);
  if (addResult == ESP_OK) {
    const int si = slaveCount;
    if (!masterAssignSlaveSlots(si)) {
      return false;
    }
    memcpy(slaveList[slaveCount], mac, 6);
    slaveLastSeenMs[slaveCount] = nowMsForSeen();
    slaveLastSyncUs[slaveCount] = 0ULL;
    slaveLastSyncRttUs[slaveCount] = 0U;
    slaveRssiValid[slaveCount] = false;
    slaveRssiWinN[slaveCount] = 0U;
    slaveRssiWinPos[slaveCount] = 0U;
    slaveBatValid[slaveCount] = false;
    slaveLastBatPct[slaveCount] = 0;
    slaveLastVcell[slaveCount] = 0.0f;
    slaveCount++;
    Serial.printf("✅ Đã thêm slave #%d: ", slaveCount);
    printMAC(mac);
    Serial.println();
    return true;
  } else if (addResult == ESP_ERR_ESPNOW_EXIST) {
    const int si = slaveCount;
    if (!masterAssignSlaveSlots(si)) {
      return false;
    }
    memcpy(slaveList[slaveCount], mac, 6);
    slaveLastSeenMs[slaveCount] = nowMsForSeen();
    slaveLastSyncUs[slaveCount] = 0ULL;
    slaveLastSyncRttUs[slaveCount] = 0U;
    slaveRssiValid[slaveCount] = false;
    slaveRssiWinN[slaveCount] = 0U;
    slaveRssiWinPos[slaveCount] = 0U;
    slaveBatValid[slaveCount] = false;
    slaveLastBatPct[slaveCount] = 0;
    slaveLastVcell[slaveCount] = 0.0f;
    slaveCount++;
    Serial.printf("ℹ️ Peer đã tồn tại, thêm vào danh sách slave #%d\n", slaveCount);
    return true;
  } else {
    Serial.printf("❌ Lỗi thêm slave peer (%d)\n", addResult);
    return false;
  }
}

/** Theo dõi LOST theo từng chunk (≤32 seq); 1s timeout trên master, tối đa 3 lần gửi. */
#define MASTER_IMU_RETX_PENDING_MAX 16
#define MASTER_IMU_RETX_TMO_MS 1000U
#define MASTER_IMU_RETX_MAX_SENDS 3U

