caonam-tugraz/MultiIMU-GaitSync/firmware/master_esp32s/ESP32-S_ESP_NOW_TIME_SYNC_MASTER.ino
void sendCalibrationToSlave(const uint8_t *dst,
                            float bx, float by, float bz,
                            float sx, float sy, float sz,
                            float globalScale,
                            float gxb, float gyb, float gzb) {
  if (!ensureSlavePeer(dst)) {
    Serial.printf("CALIB_TX,%s,FAIL,peer\n", macToString(dst).c_str());
    return;
  }

  accel_calib_packet_t pkt = {};
  strcpy(pkt.type, "CALIB");
  WiFi.macAddress(pkt.mac);
  pkt.node_id = 0;
  pkt.timestamp = nowMs();
  pkt.micros_timestamp = nowUs();
  pkt.bias[0] = bx;
  pkt.bias[1] = by;
  pkt.bias[2] = bz;
  pkt.scale[0] = sx;
  pkt.scale[1] = sy;
  pkt.scale[2] = sz;
  pkt.global_scale = globalScale;
  pkt.save_to_nvs = 1;
  pkt.enabled = 1;
  pkt.gyro_bias[0] = gxb;
  pkt.gyro_bias[1] = gyb;
  pkt.gyro_bias[2] = gzb;

  esp_err_t result = esp_now_send(dst, (uint8_t *)&pkt, sizeof(pkt));
  if (result == ESP_OK) {
    Serial.printf("CALIB_TX,%s,OK,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f\n",
                  macToString(dst).c_str(),
                  bx, by, bz, sx, sy, sz, globalScale, gxb, gyb, gzb);
  } else {
    Serial.printf("CALIB_TX,%s,FAIL,%d\n", macToString(dst).c_str(), result);
  }
}

/** Master → Slave: yêu cầu gửi lại bias/scale/global_scale hiện tại (CALREP). */
void requestCalibrationFromSlave(const uint8_t *dst) {
  if (!ensureSlavePeer(dst)) {
    Serial.printf("CALGET_TX,%s,FAIL,peer\n", macToString(dst).c_str());
    return;
  }

  accel_calib_packet_t pkt = {};
  strcpy(pkt.type, "CALGET");
  WiFi.macAddress(pkt.mac);
  pkt.node_id = 0;
  pkt.timestamp = nowMs();
  pkt.micros_timestamp = nowUs();
  pkt.bias[0] = pkt.bias[1] = pkt.bias[2] = 0.0f;
  pkt.scale[0] = pkt.scale[1] = pkt.scale[2] = 0.0f;
  pkt.global_scale = 0.0f;
  pkt.save_to_nvs = 0;
  pkt.enabled = 0;

  esp_err_t result = esp_now_send(dst, (uint8_t *)&pkt, sizeof(pkt));
  if (result == ESP_OK) {
    Serial.printf("CALGET_TX,%s,OK\n", macToString(dst).c_str());
  } else {
    Serial.printf("CALGET_TX,%s,FAIL,%d\n", macToString(dst).c_str(), result);
  }
}

void clearCalibrationOnSlave(const uint8_t *dst) {
  if (!ensureSlavePeer(dst)) {
    Serial.printf("CALIB_CLEAR_TX,%s,FAIL,peer\n", macToString(dst).c_str());
    return;
  }

  accel_calib_packet_t pkt = {};
  strcpy(pkt.type, "CALIB");
  WiFi.macAddress(pkt.mac);
  pkt.node_id = 0;
  pkt.timestamp = nowMs();
  pkt.micros_timestamp = nowUs();
  pkt.bias[0] = 0.0f;
  pkt.bias[1] = 0.0f;
  pkt.bias[2] = 0.0f;
  pkt.scale[0] = 1.0f;
  pkt.scale[1] = 1.0f;
  pkt.scale[2] = 1.0f;
  pkt.global_scale = 1.0f;
  pkt.save_to_nvs = 1;
  pkt.enabled = 0;
  pkt.gyro_bias[0] = 0.0f;
  pkt.gyro_bias[1] = 0.0f;
  pkt.gyro_bias[2] = 0.0f;

  esp_err_t result = esp_now_send(dst, (uint8_t *)&pkt, sizeof(pkt));
  if (result == ESP_OK) {
    Serial.printf("CALIB_CLEAR_TX,%s,OK\n", macToString(dst).c_str());
  } else {
    Serial.printf("CALIB_CLEAR_TX,%s,FAIL,%d\n", macToString(dst).c_str(), result);
  }
}

void processCalibrationCommand(const char *line) {
  char command[8] = {0};
  char macText[24] = {0};
  float bx, by, bz, sx, sy, sz, globalScale;
  float gxb = 0.0f, gyb = 0.0f, gzb = 0.0f;
  int parsed = sscanf(line, "%7[^,],%23[^,],%f,%f,%f,%f,%f,%f,%f,%f,%f,%f",
                      command, macText,
                      &bx, &by, &bz,
                      &sx, &sy, &sz,
                      &globalScale,
                      &gxb, &gyb, &gzb);
  if ((parsed != 9 && parsed != 12) || strcmp(command, "CALIB") != 0) {
    Serial.println("CALIB_PARSE,FAIL,format");
    return;
  }

  uint8_t targetMac[6];
  if (!parseMacString(macText, targetMac)) {
    Serial.println("CALIB_PARSE,FAIL,mac");
    return;
  }

  sendCalibrationToSlave(targetMac, bx, by, bz, sx, sy, sz, globalScale, gxb, gyb, gzb);
}

void processClearCalibrationCommand(const char *line) {
  char command[8] = {0};
  char macText[24] = {0};
  int parsed = sscanf(line, "%7[^,],%23[^,\r\n]", command, macText);
  if (parsed != 2 || strcmp(command, "CLRCAL") != 0) {
    Serial.println("CALIB_CLEAR_PARSE,FAIL,format");
    return;
  }

  uint8_t targetMac[6];
  if (!parseMacString(macText, targetMac)) {
    Serial.println("CALIB_CLEAR_PARSE,FAIL,mac");
    return;
  }

  clearCalibrationOnSlave(targetMac);
}

void processGetCalibrationCommand(const char *line) {
  char command[12] = {0};
  char macText[24] = {0};
  int parsed = sscanf(line, "%11[^,],%23[^,\r\n]", command, macText);
  if (parsed != 2 || strcmp(command, "GETCALIB") != 0) {
    Serial.println("CALGET_PARSE,FAIL,format");
    return;
  }

  uint8_t targetMac[6];
  if (!parseMacString(macText, targetMac)) {
    Serial.println("CALGET_PARSE,FAIL,mac");
    return;
  }

  requestCalibrationFromSlave(targetMac);
}

void processSerialCommands() {
  while (Serial.available() > 0) {
    char ch = (char)Serial.read();
    if (ch == '\r') {
      continue;
    }
    if (ch == '\n') {
      serialLineBuf[serialLineLen] = '\0';
      if (serialLineLen > 0 && strncmp(serialLineBuf, "CALIB,", 6) == 0) {
        processCalibrationCommand(serialLineBuf);
      } else if (serialLineLen > 0 && strncmp(serialLineBuf, "CLRCAL,", 7) == 0) {
        processClearCalibrationCommand(serialLineBuf);
      } else if (serialLineLen > 0 && strncmp(serialLineBuf, "GETCALIB,", 9) == 0) {
        processGetCalibrationCommand(serialLineBuf);
      }
      serialLineLen = 0;
      continue;
    }
    if (serialLineLen + 1 < sizeof(serialLineBuf)) {
      serialLineBuf[serialLineLen++] = ch;
    } else {
      serialLineLen = 0;
      Serial.println("CALIB_PARSE,FAIL,toolong");
    }
  }
}

void onDataRecv(const esp_now_recv_info *info, const uint8_t *incomingData, int len) {
  uint64_t rxUs = nowUs();  // thời điểm nhận packet ở master
  const uint8_t *src = info->src_addr;

  markSlaveSeen(src);
  noteSlaveRssiIfKnown(info, src);

  // ---- Slave trả lời CALGET: thông số calib đang lưu / RAM ----
  if (len == (int)sizeof(accel_calib_packet_t) || len == ACCEL_CALIB_PACKET_LEGACY_SIZE) {
    accel_calib_packet_t calibIn = {};
    memcpy(&calibIn, incomingData, (size_t)len);
    if (strncmp(calibIn.type, "CALREP", 6) == 0) {
      const float gxb = (len == (int)sizeof(accel_calib_packet_t)) ? calibIn.gyro_bias[0] : 0.0f;
      const float gyb = (len == (int)sizeof(accel_calib_packet_t)) ? calibIn.gyro_bias[1] : 0.0f;
      const float gzb = (len == (int)sizeof(accel_calib_packet_t)) ? calibIn.gyro_bias[2] : 0.0f;
      Serial.printf(
          "CALIB_REPORT,%02X:%02X:%02X:%02X:%02X:%02X,%s,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f,%.8f\n",
          src[0], src[1], src[2], src[3], src[4], src[5],
          calibIn.enabled ? "ENABLED" : "DISABLED",
          calibIn.bias[0], calibIn.bias[1], calibIn.bias[2],
          calibIn.scale[0], calibIn.scale[1], calibIn.scale[2],
          calibIn.global_scale,
          gxb, gyb, gzb);
      return;
    }
  }

  // ---- IMU batch (nhiều mẫu / gói ESP-NOW) → Serial vẫn là từng mẫu (A5 + imu_packet_raw_t) ----
  if (tryExpandImuBatchToSerial(incomingData, len, rxUs)) {
    return;
  }
  if (tryExpandImuRtxBatchToSerial(incomingData, len, rxUs)) {
    return;
  }

  // ---- VL53 batch (int16 raw / zone) → Serial từng dòng VL53,... ----
  if (tryExpandVl53BatchToSerial(incomingData, len, rxUs)) {
    return;
  }

  // ---- IMU packet (int16 thô + temp_centi_c) ----
  if (len == (int)sizeof(imu_packet_raw_t)) {
    imu_packet_raw_t raw;
    memcpy(&raw, incomingData, sizeof(raw));
    if (strncmp(raw.type, "IMU_RAW", 7) == 0) {
#if IMU_SERIAL_BINARY
      serialWriteImuRawFrame(raw);
#else
#if MASTER_SERIAL_SEQ_FILTER
      if (!imuSerialShouldForwardWithNode(raw.mac, raw.node_id, raw.sample_seq)) {
        return;
      }
#endif
      const float acc = 1.0f / 512.0f;
      const float gsc = 1.0f / IMU_RAW_GYRO_SCALE;
      const float temp_c = (float)raw.temp_centi_c / IMU_TEMP_CENTI_SCALE;
      Serial.printf(
          "IMU,%02X:%02X:%02X:%02X:%02X:%02X,%llu,%llu,%lu,%.6f,%.6f,%.6f,%.6f,%.6f,%.6f,%.4f\n",
          src[0], src[1], src[2], src[3], src[4], src[5],
          (unsigned long long)raw.micros_timestamp,
          (unsigned long long)nowUs(),
          (unsigned long)raw.sample_seq,
          raw.ax * acc, raw.ay * acc, raw.az * acc,
          raw.gx * gsc, raw.gy * gsc, raw.gz * gsc, temp_c);
#endif
      return;
    }
  }

