caonam-tugraz/MultiIMU-GaitSync/firmware/master_esp32s/ESP32-S_ESP_NOW_TIME_SYNC_MASTER.ino
  // ---- IMU packet float (slave cũ) ----
  if (len == (int)sizeof(imu_packet_t)) {
    imu_packet_t imu;
    memcpy(&imu, incomingData, sizeof(imu));

    if (strncmp(imu.type, "IMU", 3) == 0) {
#if IMU_SERIAL_BINARY
      /* Gói float cũ: không có sample_seq hợp lệ (raw=0) — gửi không lọc seq. */
      serialWriteImuRawFrameImpl(floatImuPacketToRaw(imu));
#else
      Serial.printf(
        "IMU,%02X:%02X:%02X:%02X:%02X:%02X,%llu,%llu,0,%.6f,%.6f,%.6f,%.6f,%.6f,%.6f\n",
        src[0], src[1], src[2], src[3], src[4], src[5],
        (unsigned long long)imu.micros_timestamp,
        (unsigned long long)nowUs(),
        imu.ax, imu.ay, imu.az,
        imu.gx, imu.gy, imu.gz
      );
#endif
      return;
    }
  }

  // ---- VL53 packet ----
  if (len == (int)sizeof(vl53_packet_t)) {
    vl53_packet_t vl53;
    memcpy(&vl53, incomingData, sizeof(vl53));

    if (strncmp(vl53.type, "VL53", 4) == 0) {
#if IMU_SERIAL_BINARY
      serialWriteVl53RawFrame(vl53);
#else
#if MASTER_SERIAL_SEQ_FILTER
      if (!vl53SerialShouldForward(vl53.mac, vl53.sample_seq)) {
        return;
      }
#endif
      Serial.printf("VL53,%02X:%02X:%02X:%02X:%02X:%02X,%lu,%llu,%lu",
                    src[0], src[1], src[2], src[3], src[4], src[5],
                    (unsigned long)vl53.timestamp,
                    (unsigned long long)vl53.micros_timestamp,
                    (unsigned long)vl53.sample_seq);
      for (int i = 0; i < VL53_ZONE_COUNT; i++) {
        Serial.printf(",%d", (int)vl53.distance_raw[i]);
      }
      Serial.println();
#endif
      return;
    }
  }

  // ---- control packet ----
  if (len == (int)sizeof(packet_t)) {
    packet_t pkt;
    memcpy(&pkt, incomingData, sizeof(pkt));

    if (strcmp(pkt.type, "CACK") == 0) {
      Serial.printf("CALIB_ACK,%02X:%02X:%02X:%02X:%02X:%02X,OK\n",
                    src[0], src[1], src[2], src[3], src[4], src[5]);
      return;
    }

    if (strcmp(pkt.type, "CERR") == 0) {
      Serial.printf("CALIB_ACK,%02X:%02X:%02X:%02X:%02X:%02X,FAIL\n",
                    src[0], src[1], src[2], src[3], src[4], src[5]);
      return;
    }
  }

  packet_t pkt = {};
  if (len == (int)sizeof(packet_t)) {
    memcpy(&pkt, incomingData, sizeof(pkt));
  } else if (len >= (int)PACKET_T_LEGACY_SIZE) {
    memcpy(&pkt, incomingData, (size_t)len);
    if (len < (int)sizeof(packet_t)) {
      pkt.imu_tx_slot = MASTER_SLOT_UNASSIGNED;
      pkt.sync_slot = MASTER_SLOT_UNASSIGNED;
      pkt.imu_tx_slot_count = MASTER_IMU_TX_SLOT_COUNT;
      pkt.slot_flags = 0;
    }
    if (len < (int)offsetof(packet_t, last_sync_rtt_us)) {
      pkt.last_sync_rtt_us = 0;
    }
  } else {
    return;
  }

  if (strcmp(pkt.type, "HELLO") == 0) {
    Serial.print("📩 HELLO từ ");
    printMAC(src);
    Serial.println();

    ensureSlavePeer(src);
    noteSlaveRssiIfKnown(info, src);
    sendAck(src);
    return;
  }

  if (strcmp(pkt.type, "SYNC") == 0) {
    ensureSlavePeer(src);
    noteSlaveRssiIfKnown(info, src);
    masterNoteSlaveBatteryFromSync(src, info, pkt.slave_adc_raw);
    sendTimeResponse(src, pkt, rxUs);
    return;
  }
}

void printMasterMAC() {
  uint8_t mac[6];
#if ESP_IDF_VERSION_MAJOR >= 5
  esp_wifi_get_mac(WIFI_IF_STA, mac);
#else
  esp_read_mac(mac, ESP_MAC_WIFI_STA);
#endif
  Serial.print("🚀 Master MAC: ");
  printMAC(mac);
  Serial.println();
}

void setupRadio() {
  WiFi.mode(WIFI_STA);
  WiFi.disconnect(true, true);
  esp_wifi_set_ps(WIFI_PS_NONE);
  esp_wifi_set_channel(CHANNEL, WIFI_SECOND_CHAN_NONE);

#if USE_LONG_RANGE
  esp_wifi_set_protocol(WIFI_IF_STA,
                        WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G |
                        WIFI_PROTOCOL_11N | WIFI_PROTOCOL_LR);
#else
  esp_wifi_set_protocol(WIFI_IF_STA,
                        WIFI_PROTOCOL_11B | WIFI_PROTOCOL_11G |
                        WIFI_PROTOCOL_11N);
#endif

#if MASTER_WIFI_TX_POWER_ADAPTIVE
  masterWifiTxPowerInit();
#else
  esp_wifi_set_max_tx_power(MAX_TX_POWER);
#endif

  uint8_t ch;
  wifi_second_chan_t sc;
  esp_wifi_get_channel(&ch, &sc);
  Serial.printf("Wi-Fi channel locked at %u%s\n", ch, USE_LONG_RANGE ? " (LR ON)" : "");
}

void setup() {
  Serial.setTxBufferSize(8192);
  Serial.begin(921600);
  delay(200);

  esp_bt_controller_mem_release(ESP_BT_MODE_BTDM);

  Serial.println("\n=== ESP-NOW TIME SYNC MASTER (ESP32-S, no display) ===");

  setupRadio();

  printMasterMAC();
  Serial.println("----------------------------------");

  if (esp_now_init() != ESP_OK) {
    Serial.println("❌ Lỗi khởi tạo ESP-NOW!");
    return;
  }

  esp_now_register_recv_cb(onDataRecv);

  Serial.println("✅ Master sẵn sàng, chờ slave kết nối...");
  printMasterTime();
}

void loop() {
  processSerialCommands();

  checkSlaveTimeouts();
#if MASTER_IMU_LOST_REQUEST_ENABLE
  masterImuRetxTimeoutPoll();
#endif
  static unsigned long s_lastRssiLogMs = 0;
  const unsigned long nowm = millis();
  if (slaveCount > 0 &&
      (nowm - s_lastRssiLogMs >= SLAVE_RSSI_LOG_INTERVAL_MS)) {
    s_lastRssiLogMs = nowm;
    updateSlaveRssiDisplayFromWindows();
    logSlaveRssiSummary();
  }

  if (millis() - lastPrint > 5000) {
#if !IMU_SERIAL_BINARY
    printSlaveList();
#endif
    lastPrint = millis();
  }

  delay(1);
}